{"class_name": "Model", "keras_version": "2.0.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 28, 140, 1], "name": "main_input", "sparse": false}, "inbound_nodes": [], "name": "main_input"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv_1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["main_input", 0, 0, {}]]], "name": "Conv_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv_2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["Conv_1", 0, 0, {}]]], "name": "Conv_2"}, {"class_name": "MaxPooling2D", "config": {"name": "Pool_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["Conv_2", 0, 0, {}]]], "name": "Pool_1"}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "Dropout_1"}, "inbound_nodes": [[["Pool_1", 0, 0, {}]]], "name": "Dropout_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv_3", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["Dropout_1", 0, 0, {}]]], "name": "Conv_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv_4", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["Conv_3", 0, 0, {}]]], "name": "Conv_4"}, {"class_name": "MaxPooling2D", "config": {"name": "Pool_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["Conv_4", 0, 0, {}]]], "name": "Pool_2"}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "Dropout_2"}, "inbound_nodes": [[["Pool_2", 0, 0, {}]]], "name": "Dropout_2"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "Flatten"}, "inbound_nodes": [[["Dropout_2", 0, 0, {}]]], "name": "Flatten"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "SharedDense", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["Flatten", 0, 0, {}]]], "name": "SharedDense"}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "Dropout_3"}, "inbound_nodes": [[["SharedDense", 0, 0, {}]]], "name": "Dropout_3"}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "Dropout_4"}, "inbound_nodes": [[["SharedDense", 0, 0, {}]]], "name": "Dropout_4"}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "Dropout_5"}, "inbound_nodes": [[["SharedDense", 0, 0, {}]]], "name": "Dropout_5"}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "Dropout_6"}, "inbound_nodes": [[["SharedDense", 0, 0, {}]]], "name": "Dropout_6"}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "Dropout_7"}, "inbound_nodes": [[["SharedDense", 0, 0, {}]]], "name": "Dropout_7"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "y1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 11, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["Dropout_3", 0, 0, {}]]], "name": "y1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "y2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 11, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["Dropout_4", 0, 0, {}]]], "name": "y2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "y3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 11, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["Dropout_5", 0, 0, {}]]], "name": "y3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "y4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 11, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["Dropout_6", 0, 0, {}]]], "name": "y4"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "y5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 11, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["Dropout_7", 0, 0, {}]]], "name": "y5"}], "input_layers": [["main_input", 0, 0]], "output_layers": [["y1", 0, 0], ["y2", 0, 0], ["y3", 0, 0], ["y4", 0, 0], ["y5", 0, 0]], "name": "model_11"}, "backend": "tensorflow"}